export const cellColors = ["#ff0000", "#00ff00", "#0000ff", "#ffff00",
    "#ff00ff", "#00ffff", "#E63946", "#F4A261",
    "#E9C46A", "#2A9D8F", "#4D96FF", "#6C63FF",
    "#9D4EDD", "#C77DFF", "#F72585", "#FF8AFB",
    "#84A59D", "#90BE6D", "#43AA8B", "#577590",
    "#F28482", "#F6BD60",
    "#ff00ff", "#00ffff", "#E63946", "#F4A261",
    "#E9C46A", "#2A9D8F", "#4D96FF", "#6C63FF",
    "#9D4EDD", "#C77DFF", "#F72585", "#FF8FAB",
    "#84A59D", "#90BE6D", "#43AA8B", "#577590"];


export const cellColor25 = [
  "#E6194B", // красный
  "#3CB44B", // зелёный
  "#4363D8", // синий
  "#F58231", // оранжевый
  "#911EB4", // фиолетовый
  "#42D4F4", // голубой
  "#F032E6", // пурпурный
  "#BFEF45", // салатовый
  "#9A6324", // коричневый
  "#FABED4", // розовый
  "#008080", // бирюзовый
  "#FFD700", // жёлтый
  "#800000", // бордовый
  "#AAFFC3", // мятный
  "#808000", // оливковый
  "#FFD8B1", // персиковый
  "#000080", // тёмно-синий
  "#A9A9A9", // серый
  "#FF6F61", // коралловый
  "#0072B2", // лазурно-синий
  "#D55E00", // киноварный
  "#CC79A7", // розово-лиловый
  "#56B4E9", // небесно-голубой
  "#6B8E23", // жёлто-зелёный
  "#7B68EE", // сиренево-синий
];

const colors = [
  "#000000",
  "#222E53",
  "#7D2953",
  "#008551",
  "#A95238",
  "#5F5750",
  "#C0C1C5",
  "#FFF1E8",
  "#FF074E",
  "#FFA108",
  "#FEEB2C",
  "#00E339",
  "#2CABFE",
  "#82759A",
  "#FF76A6",
  "#FFCAA8",
];

export function getPseudoRandomNumber(colors, colorNumber, randomNumber) {
  if (colors.length === 0) {
    throw new Error("Массив цветов не должен быть пустым");
  }

  if (randomNumber <= 0) {
    throw new Error("Третий аргумент должен быть больше нуля");
  }

  const color = colors[((colorNumber % colors.length) + colors.length) % colors.length];
  let number = parseInt(color.slice(1), 16);

  while (number >= randomNumber) {
    number -= randomNumber;
  }

  return number;
}

/**
 * подборка https://lospec.com/palette-list/cc-29
 */
export const cellColors30 = [
  "#f2f0e5", // светлый теплый песочный
  "#b8b5b9", // мягкий серо‑лавандовый
  "#868188", // холодный серый
  "#646365", // графитовый серый
  "#45444f", // темный серо‑фиолетовый
  "#3a3858", // глубокий индиго‑серый
  "#212123", // почти черный графит
  "#352b42", // темный фиолетово‑серый
  "#43436a", // приглушенный индиго
  "#4b80ca", // небесно‑синий насыщенный
  "#68c2d3", // бирюзовый светлый
  "#a2dcc7", // пастельный мятный
  "#ede19e", // мягкий кремово‑желтый
  "#d3a068", // теплый песочно‑оранжевый
  "#b45252", // кирпично‑красный
  "#6a536e", // пыльный фиолетовый
  "#4b4158", // темный пыльный фиолетовый
  "#80493a", // терракотовый коричневый
  "#a77b5b", // теплый бежево‑коричневый
  "#e5ceb4", // кремовый беж
  "#c2d368", // оливково‑лаймовый
  "#8ab060", // зеленый травяной
  "#567b79", // приглушенный морской зеленый
  "#4e584a", // болотный зеленый
  "#7b7243", // темный оливковый
  "#b2b47e", // светлый оливковый
  "#edc8c4", // нежный розовый
  "#cf8acb", // сиреневый насыщенный
  "#5f556a"  // серо‑фиолетовый глубокий
];